// Задачи

// 1. Найти родительский элемент для определенного узла.
//    Описание: Найти родительский элемент для элемента с id="child".
//    Ожидаемый результат: Родительский элемент с id="parent".

// 2. Найти количество дочерних узлов определенного узла.
//    Описание: Найти количество дочерних узлов для элемента с id="parent".
//    Ожидаемый результат: Количество дочерних узлов: 5.

// 3. Найти первый дочерний элемент определенного узла.
//    Описание: Найти первый дочерний элемент для элемента с id="parent".
//    Ожидаемый результат: Первый дочерний элемент: h1.

// 4. Найти последний дочерний элемент определенного узла.
//    Описание: Найти последний дочерний элемент для элемента с id="parent".
//    Ожидаемый результат: Последний дочерний элемент: table.

// 5. Найти предыдущий соседний элемент для определенного узла.
//    Описание: Найти предыдущий соседний элемент для элемента с id="child".
//    Ожидаемый результат: Предыдущий соседний элемент: p.

// 6. Найти следующий соседний элемент для определенного узла.
//    Описание: Найти следующий соседний элемент для элемента с id="child".
//    Ожидаемый результат: Следующий соседний элемент: ul.

// 7. Перебрать все дочерние узлы определенного узла.
//    Описание: Перебрать все дочерние узлы для элемента с id="parent".
//    Ожидаемый результат: Дочерние узлы: h1, p, p, div, ul, table.

// 8. Перебрать все дочерние элементы определенного узла.
//    Описание: Перебрать все дочерние элементы для элемента с id="parent".
//    Ожидаемый результат: Дочерние элементы: h1, p, p, div, ul, table.

// 9. Перебрать все соседние элементы определенного узла.
//    Описание: Перебрать все соседние элементы для элемента с id="child".
//    Ожидаемый результат: Соседние элементы: h1, ul.

// 10. Найти первый элемент в родительском элементе.
//     Описание: Найти первый элемент в родительском элементе для элемента с id="child".
//     Ожидаемый результат: Первый элемент в родительском элементе: h1.
